source('functions.r')

# Модифицированная выборка данных с https://archive.ics.uci.edu/ml/datasets/Breast+Cancer+Wisconsin+%28Diagnostic%29
# (уделен идентификатор наблюдения, добавлены имена колонок, предикторов, в колонке 'class' заменено: B = 0, M = 1)
data <- read.csv("wdbc.data", sep = ";")

# Если учитывать все предикаты данной выборки, то кривые чувствительности и специфичности оказываются неприменимы,
# поэтому, для данной работы использованы не все предикторы (полагаю, потому что среди них есть фиктивные, независимые)
data <- data[1:20]

print(crossValidate(nrow(data), data))
# В случае Leave-one-out кросс-валидации получилось, что:
# среднее число правильных ответов по контрольной выборке - 53%
# средняя площадь ROC кривой - 0.9944361

print(crossValidate(2, data))
# В случае 2-fold кросс-валидации получилось, что:
# среднее число правильных ответов по контрольной выборке - 58.5%
# средняя площадь ROC кривой - 0.9980296

print(crossValidate(5, data))
# В случае 5-fold кросс-валидации получилось, что:
# среднее число правильных ответов по контрольной выборке - 53.6%
# средняя площадь ROC кривой - 0.995363

print(crossValidate(70, data, method = 'percent'))
# В случае holdout(70% training, 30% testing) кросс-валидации получилось, что:
# среднее число правильных ответов по контрольной выборке - 57.3%
# средняя площадь ROC кривой - 0.995898