source('functions.r')

# Модифицированная выборка данных с https://archive.ics.uci.edu/ml/datasets/Breast+Cancer+Wisconsin+%28Diagnostic%29
# (уделен идентификатор наблюдения, добавлены имена колонок, предикторов, в колонке 'class' заменено: B = 0, M = 1)
data <- read.csv("wdbc.data", sep = ";")

print(crossValidate(nrow(data), data))
# В случае Leave-one-out кросс-валидации получилось, что:
# среднее число правильных ответов по контрольной выборке - 62.7%
# средняя площадь ROC кривой - 0.6613023

print(crossValidate(2, data))
# В случае 2-fold кросс-валидации получилось, что:
# среднее число правильных ответов по контрольной выборке - 97.1%
# средняя площадь ROC кривой - 0.988548

print(crossValidate(5, data))
# В случае 5-fold кросс-валидации получилось, что:
# среднее число правильных ответов по контрольной выборке - 87.2%
# средняя площадь ROC кривой - 0.9669501

print(crossValidate(70, data, method = 'percent'))
# В случае holdout(70% training, 30% testing) кросс-валидации получилось, что:
# среднее число правильных ответов по контрольной выборке - 95.5%
# средняя площадь ROC кривой - 0.9688549